<template>
<div id="AllCountry">
  <div class="text">
    <div class="country" v-for="item in country_list">
      <a @click="to(item)">{{item}}</a>
    </div>
  </div>
</div>
</template>

<script>
import world_data from '/src/api/world.json'
export default {
  name: "AllCountry",
  data(){
    return{
      country_list:['阿富汗', '安哥拉', '阿尔巴尼亚', '阿尔及利亚', '阿根廷', '亚美尼亚', '澳大利亚', '奥地利', '阿塞拜疆', '布隆迪', '比利时', '贝宁', '布基纳法索', '孟加拉国', '保加利亚', '波斯尼亚和黑塞哥维那', '白俄罗斯', '伯利兹', '百慕大群岛', '玻利维亚', '巴西', '文莱', '不丹', '博茨瓦纳', '柬埔寨', '喀麦隆', '加拿大', '中非共和国', '乍得', '智利', '中国', '哥伦比亚', '刚果', '科特迪瓦', '哥斯达黎加', '克罗地亚', '古巴', '塞浦路斯', '捷克共和国', '民主刚果', '丹麦', '吉布提', '多米尼加共和国', '东帝汶', '厄瓜多尔', '埃及', '萨尔瓦多', '赤道几内亚', '厄立特里亚', '爱沙尼亚', '埃塞俄比亚', '福克兰群岛', '斐济', '芬兰', '法国', '法属圭亚那', '法属南部领地', '加蓬', '冈比亚', '德国', '佐治亚州', '加纳', '希腊', '格陵兰', '危地马拉', '几内亚', '几内亚比绍', '圭亚那', '海地', '赫德岛和麦克唐纳群岛', '洪都拉斯', '匈牙利', '冰岛', '印度', '印度尼西亚', '伊朗', '伊拉克', '爱尔兰', '以色列', '意大利', '象牙海岸', '牙买加', '日本', '乔丹', '克什米尔', '哈萨克斯坦', '肯尼亚', '科索沃', '科威特', '吉尔吉斯斯坦', '老挝', '老挝人民民主共和国', '拉脱维亚', '黎巴嫩', '莱索托', '利比里亚', '利比亚', '立陶宛', '卢森堡',
        '马达加斯加','马其顿', '马拉维', '马来西亚', '马里', '毛里塔尼亚', '墨西哥', '摩尔多瓦', '蒙古', '黑山', '摩洛哥', '莫桑比克', '缅甸', '纳米比亚', '荷兰', '新喀里多尼亚', '新西兰', '尼泊尔', '尼加拉瓜', '尼日尔', '尼日利亚', '朝鲜', '北塞浦路斯', '挪威', '阿曼', '巴基斯坦', '巴拿马', '巴布亚新几内亚', '巴拉圭', '秘鲁', '刚果共和国', '菲律宾', '波兰', '葡萄牙', '波多黎各', '卡塔尔', '塞舌尔共和国', '罗马尼亚', '俄罗斯', '卢旺达', '萨摩亚', '沙特阿拉伯', '塞内加尔', '塞尔维亚', '塞拉利昂', '斯洛伐克', '斯洛文尼亚', '所罗门群岛', '索马里兰', '索马里', '南非', '南乔治亚和南桑德威奇群岛', '韩国', '南苏丹', '西班牙', '斯里兰卡', '苏丹', '苏里南', '斯威士兰', '瑞典', '瑞士', '叙利亚', '塔吉克斯坦', '坦桑尼亚', '泰国', '汤加王国', '巴哈马', '多哥', '特立尼达和多巴哥', '突尼斯', '土耳其', '土库曼斯坦', '乌干达', '乌克兰', '阿拉伯联合酋长国', '大不列颠联合王国', '坦桑尼亚联合共和国', '美国', '美利坚合众国', '乌拉圭', '乌兹别克斯坦', '瓦努阿图', '委内瑞拉', '越南', '西岸', '西撒哈拉', '也门', '赞比亚', '津巴布韦']
    }
  },
  methods:{
    to(name){
      this.$router.push({
        path:`/Country/${name}`
      })
    }
  },
  mounted() {
    var list=[]
    for(var i=0; i<world_data.dataArr.length; i++){
      list.push(world_data.dataArr[i].name)
    }
    console.log(list)
  }
}
</script>

<style scoped>
#AllCountry{
  /*border: 1px solid red;*/
  height: 1000px;
}
.text{
  height: 650px;
  overflow: auto;
  border: 1px solid blanchedalmond;
  padding-top: 30px;
  padding-left: 50px;
}
.country{
  width: 250px;
  height: 50px;
  float: left;
  font-size: 20px;
}
a{
  color: black;
  cursor: pointer;
}
a:hover{
  color: lightskyblue;
  cursor: pointer;
}

</style>